# pandas

the series data structure

In [3]:
import pandas as pd
pd.Series?

In [4]:
animals=['tiger','bear','moose']
pd.Series(animals)

0    tiger
1     bear
2    moose
dtype: object

In [6]:
numbers=[1,2,3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [7]:
animals=['tiger','bear',None]
pd.Series(animals)
#it returns None as an object

0    tiger
1     bear
2     None
dtype: object

In [8]:
numbers=[1,2,None]
pd.Series(numbers)
#here it returns None as NaN (no a number)a special float

0    1.0
1    2.0
2    NaN
dtype: float64

In [9]:
import numpy as np
np.NaN==None

False

In [10]:
np.NaN==np.NaN

False

NaN is a special float 
we cant do the equality test directly
we need a speial function 'isnan'

In [12]:
np.isnan(np.NaN)

True

In [15]:
sports={'archery':'Bhutan',
        'Golf':'Scotland',
        'Sumo':'Japan',
         'Taekwando':'South korea'}
s=pd.Series(sports)
s

archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwando    South korea
dtype: object

In [17]:
s.index
#get the index by using index attribute

Index(['archery', 'Golf', 'Sumo', 'Taekwando'], dtype='object')

In [19]:
s=pd.Series(['Tiger','Bear','Moose'],index=['India','America','Canada'])
s
#series can also be defined by giving index in te form of list

India      Tiger
America     Bear
Canada     Moose
dtype: object

#querying a data

In [20]:
sports={'archery':'Bhutan',
        'Golf':'Scotland',
        'Sumo':'Japan',
         'Taekwando':'South korea'}
s=pd.Series(sports,index=['Golf','Sumo','Hockey'])
s
#returns NaN for the null object

Golf      Scotland
Sumo         Japan
Hockey         NaN
dtype: object

In [25]:
s.loc['Golf']
#loc attribute is used for row selection

'Scotland'

In [26]:
sports={'archery':'Bhutan',
        'Golf':'Scotland',
        'Sumo':'Japan',
         'Taekwando':'South korea'}
s=pd.Series(sports)
s

archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwando    South korea
dtype: object

In [27]:
s.iloc[3]
#iloc attribute is used to access a data with index number

'South korea'

In [28]:
s[3]

'South korea'

In [29]:
s['Golf']

'Scotland'

In [30]:
sports={99:'Bhutan',
        100:'Scotland',
        101:'Japan',
         102:'South korea'}
s=pd.Series(sports)
s

99          Bhutan
100       Scotland
101          Japan
102    South korea
dtype: object

In [31]:
s[0]
#this wont call s.iloc[0]as one might expect ,it generates an error instead.

KeyError: 0

In [32]:
s=pd.Series([100.0,120.0,101.0,3.0])
s

0    100.0
1    120.0
2    101.0
3      3.0
dtype: float64

In [35]:
total=0

for item in s:
    total+=item
    
total
    #it works but it is a bit slower

324.0

In [34]:
import numpy as np
total=np.sum(s)
total
#this method is  faster

324.0

In [37]:
s=pd.Series(np.random.randint(0,1000,10000))
s.head()
#creates big series of random numbers

0    109
1    142
2    333
3    887
4    718
dtype: int32

In [38]:
len(s)

10000

timeit is magic function used to calculate the time taken to execute the function.

In [39]:
%%timeit -n 100

summary=0
for item in s:
    summary+=item
    
 
#here 100 shows number of loops

1.21 ms ± 22 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [41]:
%%timeit -n 100

summarry=np.sum(s)

88.1 µs ± 11.2 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

this proves that the second method is much faster than the firstone

In [43]:
s=pd.Series([1,2,3])
s.loc['Animals']='Bears'
s


#mixed type of data values are no problem for pandas

0              1
1              2
2              3
Animals    Bears
dtype: object

#The DataFrame Datastructure

In [2]:
import pandas as pd

purchase_1=({'name':'chris',
             'item purchased':'dog food',
             'cost':22.50})
purchase_2=({'name':'kevyin',
             'item purchased':'kitter litter',
             'cost':2.50})
purchase_3=({'name':'vinod',
             'item purchased':'bird seed',
             'cost':5.00})
df=pd.DataFrame([purchase_1,purchase_2,purchase_3],
                index=['store 1','store 1','store 2'])
df

           name item purchased  cost
store 1   chris       dog food  22.5
store 1  kevyin  kitter litter   2.5
store 2   vinod      bird seed   5.0

In [3]:
df.loc['store 2']

name                  vinod
item purchased    bird seed
cost                      5
Name: store 2, dtype: object

In [4]:
type(df.loc['store 2'])

pandas.core.series.Series

In [5]:
df.loc['store 1']

           name item purchased  cost
store 1   chris       dog food  22.5
store 1  kevyin  kitter litter   2.5

In [6]:
df.loc['store 1','cost']

store 1    22.5
store 1     2.5
Name: cost, dtype: float64

In [7]:
df.T

                 store 1        store 1    store 2
name               chris         kevyin      vinod
item purchased  dog food  kitter litter  bird seed
cost                22.5            2.5          5

In [8]:
df.T.loc['cost']

store 1    22.5
store 1     2.5
store 2       5
Name: cost, dtype: object

In [9]:
df['cost']

store 1    22.5
store 1     2.5
store 2     5.0
Name: cost, dtype: float64

In [10]:
df.loc['store 1']['cost']
#chaining returns copy of the data instead of view of the data

store 1    22.5
store 1     2.5
Name: cost, dtype: float64

In [12]:
df.loc[: ,['name','cost']]
#.loc attribute also supports slicing

           name  cost
store 1   chris  22.5
store 1  kevyin   2.5
store 2   vinod   5.0

In [13]:
df.drop('store 1')
#drops store 1

          name item purchased  cost
store 2  vinod      bird seed   5.0

In [14]:
df

           name item purchased  cost
store 1   chris       dog food  22.5
store 1  kevyin  kitter litter   2.5
store 2   vinod      bird seed   5.0

In [16]:
copy_df=df.copy()
copy_df=copy_df.drop('store 1')
copy_df

          name item purchased  cost
store 2  vinod      bird seed   5.0

In [17]:
df

           name item purchased  cost
store 1   chris       dog food  22.5
store 1  kevyin  kitter litter   2.5
store 2   vinod      bird seed   5.0

In [18]:
copy_df.drop?

In [23]:
del copy_df['cost']
copy_df
#deletes the column name cost

        item purchased
store 2      bird seed

#DataFrame Indexing and loading

In [26]:
purchase_1=({'name':'chris',
             'item purchased':'dog food',
             'cost':22.50})
purchase_2=({'name':'kevyin',
             'item purchased':'kitter litter',
             'cost':2.50})
purchase_3=({'name':'vinod',
             'item purchased':'bird seed',
             'cost':5.00})
df=pd.DataFrame([purchase_1,purchase_2,purchase_3],
                index=['store 1','store 1','store 2'])
df

           name item purchased  cost
store 1   chris       dog food  22.5
store 1  kevyin  kitter litter   2.5
store 2   vinod      bird seed   5.0

In [28]:
df.T

                 store 1        store 1    store 2
name               chris         kevyin      vinod
item purchased  dog food  kitter litter  bird seed
cost                22.5            2.5          5

In [37]:
df

           name item purchased  cost
store 1   chris       dog food  22.5
store 1  kevyin  kitter litter   2.5
store 2   vinod      bird seed   5.0

In [38]:
df['location']=None
df
#adding a new column

           name item purchased  cost location
store 1   chris       dog food  22.5     None
store 1  kevyin  kitter litter   2.5     None
store 2   vinod      bird seed   5.0     None

In [41]:
df.T

                 store 1        store 1    store 2
name               chris         kevyin      vinod
item purchased  dog food  kitter litter  bird seed
cost                22.5            2.5          5
location            None           None       None

#practise with real world data

In [2]:
import pandas as pd


df=pd.read_csv('olympics.csv')
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,NaN,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !,02 !,03 !,Total,№ Games,01 !,02 !,03 !,Combined total
1,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
2,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
3,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
4,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12

In [3]:
df=pd.read_csv('olympics.csv',index_col=0,skiprows=1)
df
#removes first row and first column

,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !.1,02 !.1,03 !.1,Total.1,№ Games,01 !.2,02 !.2,03 !.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Independent Olympic Participants (IOP) [IOP],1,0,1,2,3,0,0,0,0,0,1,0,1,2,3
Zambia (ZAM) [ZAM],12,0,1,1,2,0,0,0,0,0,12,0,1,1,2
Zimbabwe (ZIM) [ZIM],12,3,4,1,8,1,0,0,0,0,13,3,4,1,8
Mixed team (ZZX) [ZZX],3,8,5,4,17,0,0,0,0,0,3,8,5,4,17
Totals,27,4809,4775,5130,14714,22,959,958,948,2865,49,5768,5733,6078,17579

In [4]:
df.columns
#returns columns

Index(['№ Summer', '01 !', '02 !', '03 !', 'Total', '№ Winter', '01 !.1',
       '02 !.1', '03 !.1', 'Total.1', '№ Games', '01 !.2', '02 !.2', '03 !.2',
       'Combined total'],
      dtype='object')

In [ ]:
ddddddd